[
  {
    "name": "School of Business and Digital Technologies",
    "shortName": "Business & Digital Technologies",
    "nameStump": "busIT",
    "image": "/images/about/qualitycontrol1.jpg",
    "overview": "The School of Business and Digital Technologies provides access to a world-class and work-relevant education, focused on achieving institutional and national goals of workforce development. The School of Business and Digital Technologies comprises two (2) schools, the Department of ICTs and Digital Technologies and the Department of Management and Digital Entrepreneurship. These departments provide the public with a range of academic services to meet a growing number of careers and opportunities locally, regionally, and globally.",
    "dean": {
      "name": "Dr. Kyra Mc Gowan-Santana",
      "image": "/images/schools/deans/Kyra Mc Gowan-Santana.jpg",
      "message": "Welcome to the School of Business and Digital Technologies at COSTAATT. The School offers courses of study that lead to the award of certificates, diplomas, associate and bachelor’s degrees. We are in the business of changing lives, a key component of which is preparing our students through hands-on skills development for future careers using technology. Faculty members incorporate the use of cutting-edge business techniques, digital technology and information science to prepare students for new innovative opportunities where others see challenges. We welcome you to our School and to a dynamic and promising future!",
      "email": "kmsantana@costaatt.edu.tt",
      "phone": "868-625-5030"
    },
    "areasofStudy": [
            "Accounting",
            "Business Administration",
            "Entrepreneurship",
            "Human Resources",
            "Information Technology",
            "Library Studies",
            "Marketing",
            "Networking",
            "Supervisory Management",
            "Records Management",
            "Web Development"

    ],

    "departments": [
      {
        "name": "Management and Digital Entrepreneurship",
        "headImage": "/images/schools/departments/MGDEheader.png",
        "image": "/images/schools/departments/MGDEsmall.png",
        "summary": "At the Department of Management and Digital Entrepreneurship, our mission is to nurture and develop entrepreneurs whose creative vision, innovative skills and knowledge gained through our programmes, will make them drivers of growth and development in Trinidad and Tobago.",
        "coreValues": [
          "Integrity",
          "Compassion",
          "Innovation",
          "Student-Centeredness",
          "Lifelong-Learning"
        ],
        "shortName": "Department",
        "dept_code": "MGDE",
        "contacts": [],
        "programmes": [
          {
            "prog_code": "ACCT_BA",
            "prog_shortname": "baAccounting",
            "prog_name": "BA Accounting",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 86,
            "prog_core_credits": 30,
            "prog_elect_credits": 0,
            "prog_supp_credits": 4,
            "prog_description": "The Bachelor of Arts in Accounting degree provides students with technical financial accounting skills which are complemented with a solid foundation in business management and general education competencies that enhance workplace performance. The programme is relevant to individuals seeking careers in financial services in a variety of related fields in the public and private sector. Students enrolled in the Bachelor of Arts degree in Accounting will earn the Associate in Applied Science - Management with Accounting after the first 61 credits."
          },
          {
            "prog_code": "BSAD_AAS",
            "prog_shortname": "aasBusAdmin",
            "prog_name": "AAS  Business Administration",
            "prog_level": "Associate",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 40,
            "prog_core_credits": 15,
            "prog_elect_credits": 6,
            "prog_supp_credits": 0,
            "prog_description": "The AAS degree in Business Administration prepares the student for entry into a business environment, ensuring that they understand the fundamental operations of any business, including accounting, management, finance and marketing.  With value-added courses in project management and information systems, students are well prepared to take up a role to support managerial and business functions at the end of this programme"
          },

          {
            "prog_code": "CERT_SMGT",
            "prog_shortname": "certSupMgmt",
            "prog_name": "Certificate in Supervisory Management ",
            "prog_level": "Certificate",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 18,
            "prog_core_credits": 0,
            "prog_elect_credits": 0,
            "prog_supp_credits": 0,
            "prog_description": "This certificate programme is the first level of a two-year diploma programme which has been specially designed for persons who have been assigned supervisory responsibilities without formal training.  In addition to acquiring practical supervisory skills and enhanced communication skills, students are exposed to the theoretical framework of organizational behavior which will equip them to make more judicious and informed decisions."
          },
          {
            "prog_code": "DIPL_SMGT",
            "prog_shortname": "dipSupMgmt",
            "prog_name": "Diploma in Supervisory Management ",
            "prog_level": "Diploma",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 36,
            "prog_core_credits": 0,
            "prog_elect_credits": 0,
            "prog_supp_credits": 0,
            "prog_description": "This two year part-time programme is specially designed for persons who have been assigned supervisory responsibilities without formal training. Students learn practical skills in supervision, effective communication, conflict management and resolution, industrial relations, financial procedures and budgeting. Applicants with significant supervisory experience can apply for exemption from selected Year 1 courses through the College's Prior Learning Assessment and Recognition (PLAR) Services"
          },
          {
            "prog_code": "ENTP_BBA",
            "prog_shortname": "baMgmtEntrep",
            "prog_name": "BBA Management and Entrepreneurship",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 88,
            "prog_core_credits": 30,
            "prog_elect_credits": 3,
            "prog_supp_credits": 0,
            "prog_description": "The Bachelor of Business Administration in Management and Entrepreneurship provides provides students with the foundations for functioning in and managing 21st century business. It addresses important issues in management and leadership within organisations and develops key entrepreneurship and business development competencies needed to drive a modern economy. Students will be exposed to a course of study that spans the major managerial functions thereby equipping them to undertake a variety of roles within organisations. In addition, the programme fosters the development of skills and values considered fundamental to the formation of educated citizens and community leaders, such as independent and critical thinking, creative problem-solving and lifelong learning."
          },
          {
            "prog_code": "HURM_BBA",
            "prog_shortname": "bbaHRMgmt",
            "prog_name": "BBA Human Resource Management ",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 86,
            "prog_core_credits": 30,
            "prog_elect_credits": 3,
            "prog_supp_credits": 3,
            "prog_description": "The Bachelor of Business Administration degree in Human Resource Management prepares students to function as HRM professionals within public and private sector organizations, locally and internationally. Students gain insight into cutting edge practices in HR for the 21st century organization and acquire a wide range of skills in core HR competencies such as training and development, industrial relations, strategic human resource management, compensation and human resource management information systems. Specific attention is paid to HR as a key strategy in public sector reform."
          },
          {
            "prog_code": "MKTG_BBA",
            "prog_shortname": "bbaMarketing",
            "prog_name": "BBA Marketing",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 78,
            "prog_core_credits": 30,
            "prog_elect_credits": 12,
            "prog_supp_credits": 0,
            "prog_description": "Effective marketing is a key requirement for every successful business and industry. The Bachelor of Business Administration in Marketing is designed to provide graduates with a broad foundation in business administration and specialized competencies in marketing and marketing management."
          },
          {
            "prog_code": "MSPS_AAS",
            "prog_shortname": "ASMangStuProServ",
            "prog_name": "AAS  Management Studies for the Protective Services",
            "prog_level": "Associate",
            "prog_del_mode": "Blended",
            "dept_code": "MGDE",
            "prog_major_credits": 30,
            "prog_core_credits": 15,
            "prog_elect_credits": 18,
            "prog_supp_credits": 0,
            "prog_description": "This programme is designed to provide participants from the Protective Services with the needed competencies to improve efficiencies in their supervisory roles and to prepare them to be change agents in the various services. Participants are exposed to managerial concepts as well as practical aspects of managing resources in an efficient and effective manner.  This programme will allow participants to access the BA degree in Public Sector Management."
          }
        ]
      },
      {
        "name": "ICTs and Digital Technologies",
        "headImage": "/images/about/qualitycontrol1.jpg",
        "image": "/images/schools/departments/ICTDsmall.png",
        "mission": "The department of ICT's and Digital Technologies is the hub were technologies meet. It's an infusion of Library Science and Technology. If you desire to be exposed to technology that runs through the viens of the world, you have come to the right place. You can specialize in Databases,Networking, Library Science and Web Development. You will be exposed to the best and latest technologies all while learning the building blocks that makes up Information and Technology.",
        "summary": "If you are interested in Web Development (Internet Technologies), Information Technology, Networking, Databases, Information Systems, or Library Science then the programmes offered by the Department of Information Science and Technology are tailor-made for you. ",
        "coreValues": [
          "Dedication",
          "Teamwork",
          "Integrity",
          "Compassion",
          "Innovation",
          "Student-Centeredness",
          "Lifelong-Learning"
        ],
        "shortName": "ICTs and Digital Technologies",
        "contacts": ["mcharles", "rdavid"],
        "dept_code": "ICTD",
        "programmes": [
          {
            "prog_code": "CERT_WEB",
            "prog_shortname": "certWebDev",
            "prog_name": "Certificate in IT - Web Development",
            "prog_level": "Certificate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 15,
            "prog_core_credits": 0,
            "prog_elect_credits": 0,
            "prog_supp_credits": 0,
            "prog_description": "The Certificate in Web Development is designed for ..."
          },
          {
            "prog_code": "CERT_CCNA",
            "prog_shortname": "certCCNA",
            "prog_name": "Certificate in CISCO-CCNA",
            "prog_level": "Certificate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 16,
            "prog_core_credits": 0,
            "prog_elect_credits": 0,
            "prog_supp_credits": 0,
            "prog_description": "The CISCO Certified Network Associate Certificate is designed for CISCO Networking Academy students.  The programme provides an integrated and comprehensive coverage of networking topics, from fundamentals to advanced applications and services and offers students the hands-on practical experience required for industry.  Upon completion of this curriculum, students will be prepared to sit CISCO Certified Network Associate examinations leading to a professional certification in networking. This programme normally fulfills matriculation requirements for networking engineering degree programmes."
          },
          {
            "prog_code": "CERT_RECM",
            "prog_shortname": "certRecMgmt",
            "prog_name": "Certificate in Records Management",
            "prog_level": "Certificate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 20,
            "prog_core_credits": 0,
            "prog_elect_credits": 0,
            "prog_supp_credits": 0,
            "prog_description": "This certificate programme is designed to provide training for persons who have at least three (3) years’ work experience in records management in a public or private sector organization.  Students will examine topics such as the classification, storage, preservation, retention and disposal of records."
          },
          {
            "prog_code": "ILSC_BS",
            "prog_shortname": "bscLIS",
            "prog_name": "BSc Information and Library  Science ",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 75,
            "prog_core_credits": 33,
            "prog_elect_credits": 9,
            "prog_supp_credits": 3,
            "prog_description": "Graduates of this programme qualify for employment in a variety of professional positions in schools, public, academic and special libraries or in any other organization engaged in library-related and information management activities. The course content covers areas such as management of libraries and information centres, library organisation, library reference services, technical services in libraries, media management, library standards and practices."
          },
          {
            "prog_code": "ITGN_AAS",
            "prog_shortname": "aasITGen",
            "prog_name": "AAS Information Technology - General",
            "prog_level": "Associate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 39,
            "prog_core_credits": 15,
            "prog_elect_credits": 4,
            "prog_supp_credits": 6,
            "prog_description": "This degree programme essentially comprises the first two years of the Bachelor of Science in Information Technology. Students pursuing a Bachelor of Science in Information Technology can exit with an Associate in Applied Science degree in Information Technology once they have completed the prescribed list of courses below. Graduates at the associate level in information technology will be prepared for technician or technologist entry level positions in the job market."
          },
          {
            "prog_code": "ITWEB_AAS",
            "prog_shortname": "aasWebDev",
            "prog_name": "AAS Information Technology - Web Development",
            "prog_level": "Associate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 42,
            "prog_core_credits": 15,
            "prog_elect_credits": 0,
            "prog_supp_credits": 3,
            "prog_description": "This degree programme essentially comprises the first two years of the Bachelor of Science in Information Technology. Students pursuing a Bachelor of Science in Information Technology can exit with an Associate in Applied Science degree in Information Technology once they have completed the prescribed list of courses below. Graduates at the associate level in information technology will be prepared for technician or technologist entry level positions in the job market."
          },
          {
            "prog_code": "ITGN_BS",
            "prog_shortname": "bscITGen",
            "prog_name": "BSc Information Technology - General",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 72,
            "prog_core_credits": 30,
            "prog_elect_credits": 13,
            "prog_supp_credits": 6,
            "prog_description": "This general IT degree provides students with a well-rounded knowledge of the fundamental skills necessary to develop and maintain the changes required in the dynamic and challenging information technology field.  The graduate will have the advantage of being able to work in diverse environments throughout the information technology industry. The practical knowledge gained from the programme provides a foundation of information technology skill-sets that can be used in the fields of IT Project Manager, IT Teacher, Java Developer, Business Analyst, Database Administrator, Software Implementation Analyst, Applications Architect, Windows Administrator, Enterprise Architect  or any number of fields within the industry."
          },
          {
            "prog_code": "ITWEB_BS",
            "prog_shortname": "bscWebDev",
            "prog_name": "BSc Information Technology - Web Development",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 84,
            "prog_core_credits": 30,
            "prog_elect_credits": 3,
            "prog_supp_credits": 3,
            "prog_description": "A degree specialization in the Web Development (Internet Technology) track will provide students with the fundamental skills necessary to develop and maintain the changes required in this dynamic and challenging field.  Students will learn the basics of Internet application development and understand the importance of data security of the internet.   A well-rounded programme of instruction addresses both the technical aspects of the field, as well as the many emerging business applications.  The graduate will have the advantage of being able to work in diversified environments throughout the information technology industry. The practical knowledge gained from the programme provides a foundation of information technology skill-sets that can be used in website development, network management, programming, systems analysis, project management, e-commerce, or any number of fields within the industry. This programme is designed for students to be able to sit the CIW professional examinations."
          },
          {
            "prog_code": "ITNT_BS",
            "prog_shortname": "bscITNetworking",
            "prog_name": "BSc IT - Networking",
            "prog_level": "Bachelor",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 75,
            "prog_core_credits": 30,
            "prog_elect_credits": 12,
            "prog_supp_credits": 4,
            "prog_description": "The degree specialization in Networking is designed for individuals seeking a career in Information Technology with an emphasis on Networking. Some of the key areas include Network Administration, Network Security, Network Architecture and Wireless Communication. Students will have hands-on experiences with Network Systems commonly found in business environments.  Students will discover how information systems support organizational success.  Students will discover the technologies that make up the network infrastructures that allow for the successful transfer and use of mission-critical business information.  They will install, configure, secure, administer, and troubleshoot network systems.  Students will also address managing users, shared resources, and various other network components like routers and switches in LANs, WANs, and wireless and mobile network environments. This programme has been built to include the necessary competencies to complete the CCNA and CISSP professional examinations."
          },
          {
            "prog_code": "LBIS_AAS",
            "prog_shortname": "aasLIS",
            "prog_name": "AAS Library and Information Studies",
            "prog_level": "Associate",
            "prog_del_mode": "Blended",
            "dept_code": "ICTD",
            "prog_major_credits": 30,
            "prog_core_credits": 18,
            "prog_elect_credits": 9,
            "prog_supp_credits": 3,
            "prog_description": "Graduates of this programme qualify for employment in a variety of para-professional positions in schools, public, academic and special libraries or in any other organization engaged in library-related and information management activities."
          }
        ]
      }
    ]
  }
]
